# 方塊加速速度
brick_drop_rapidly   = 0.05
# 方塊正常速度
brick_down_speed_max = 0.4

# 視窗大小
canvas_width = 800
canvas_height = 600

# 定義顏色
color_block         = (20, 30, 45)
color_white         = (235, 240, 255)
color_red           = (235, 85, 95)
color_gray          = (80, 110, 150)
color_gray_block    = (50, 60, 85)
color_gray_green    = (110, 220, 110)

color_brick_S       = (65, 175, 245)    
color_brick_Z       = (235, 120, 120)  #x   
color_brick_J       = (120, 50, 240) #x   
color_brick_L       = (245, 175, 65)    
color_brick_T       = (85, 195, 95)     
color_brick_O       = (245, 225, 80)    
color_brick_I       = (95, 220, 215)    


# 定義方塊
brick_dict = {
    "10": ( 4, 8, 9,13), "11": ( 9,10,12,13),   # S
    "20": ( 5, 8, 9,12), "21": ( 8, 9,13,14),   # Z
    "30": ( 8,12,13,14), "31": ( 4, 5, 8,12), "32": (8,  9, 10, 14), "33": (5,  9, 12, 13), # J
    "40": (10,12,13,14), "41": ( 4, 8,12,13), "42": (8,  9, 10, 12), "43": (4,  5,  9, 13), # L
    "50": ( 9,12,13,14), "51": ( 4, 8, 9,12), "52": (8,  9, 10, 13), "53": (5,  8,  9, 13), # T
    "60": ( 8, 9,12,13),    # O
    "70": (12,13,14,15), "71": ( 1, 5, 9,13)    #I
}
